#define _CRT_SECURE_NO_WARNINGS

// 6-1
#include <stdio.h>

int main(void)
{
	int a = 1;


	return 0;
}

// 6-2


// 6-4 중첩 반복문


// 6-5 break문


// 7-1 두개의 함수로 만든 프로그램


// 7-2 매개변수가 없는 함수


// 7-3 반환값이 없는 함수


// 7-4 반환값과 매개변수가 모두 없는 함수


// 7-6 재귀호출 함수


// 7-7 없는데,,


// 8-1 배열의 선언


// 8-2 배열과 반복문을 사용한 성적 처리 프로그램


// 8-3 sizeof 연산자를 사용한 배열


// 8-4 문자열을 저장하는 char형 배열


// 8-5 문자열을 대입하는 strcpy 함수


// 8-6 빈칸을 포함한 문자열 입력


// 9-1 변수의 메모리 주소 확인


// 9-2 포인터의 선언과 활용


// 9-3 포인터를 사용한 두 정수의 합과 평균 계산


// 9-5 주소와 포인터의 크기


// 9-7 포인터를 사용한 두 변수의 값 교환


// 9-9 변수의 값을 인수로 주는 경우


// 10-1 


// 10-2


// 10-4


// 10-5


// 10-6


// 10-7